ppi/app/Models/AnimaisModel.php

    public function getAnimais( $cd_animal = false){
        if($cd_animal === false){
            return $this->select('animais.*, status.ds_nome_status')
                ->join('status', 'animais.cd_status = status.cd_status')
                ->orderBy('updated_at', 'desc')
                ->findAll();
        } else {
            return $this->asArray()
                ->where('cd_animal', $cd_animal)
                ->first();
---
SELECT `animais`.*, `status`.`ds_nome_status`
FROM `animais`
JOIN `status` ON `animais`.`cd_status` = `status`.`cd_status`
WHERE `animais`.`deleted_at` IS NULL
ORDER BY `updated_at` DESC
SELECT *
FROM `animais`
WHERE `cd_animal` = '3'
AND `animais`.`deleted_at` IS NULL
 LIMIT 1