ppi/app/Models/StatusModel.php

    public function getStatus($id = false){
        if($id === false){
            return $this->orderBy('cd_status', 'desc')->findAll();
---
SELECT *
FROM `status`
WHERE `status`.`deleted_at` IS NULL
ORDER BY `cd_status` DESC