ppi/app/Controllers/Animais.php

SELECT *
FROM `animais`
WHERE `animais`.`deleted_at` IS NULL
 LIMIT 6, 6
SELECT COUNT(*) AS `numrows`
FROM `animais`
WHERE `animais`.`deleted_at` IS NULL
---
    public function index(){

        $animaisModel = new AnimaisModel();

        $data = array(
            'title' => 'Cadastro ONG',
            'animais' => $animaisModel->paginate(6),