ppi/app/Controllers/Animais.php

    public function index()
    {

        $animaisModel = new AnimaisModel();

        $data = array(
            'title' => 'Cadastro ONG',
            'animais' => $animaisModel
            ->join('status', 'animais.cd_status = status.cd_status')
            ->paginate(6),
            'pager' => $animaisModel->pager,
            'msg' => '',
        );
---
SELECT *
FROM `animais`
JOIN `status` ON `animais`.`cd_status` = `status`.`cd_status`
WHERE `animais`.`deleted_at` IS NULL
 LIMIT 12, 6
SELECT COUNT(*) AS `numrows`
FROM `animais`
JOIN `status` ON `animais`.`cd_status` = `status`.`cd_status`
WHERE `animais`.`deleted_at` IS NULL
SELECT *
FROM `animais`
JOIN `status` ON `animais`.`cd_status` = `status`.`cd_status`
WHERE `animais`.`deleted_at` IS NULL
 LIMIT 6